benchmark/benchmark-result-2025-12-26/sleep_1ms/no-keep-alive/woo_threads-NIL-default.log
woo_threads-NIL-default.log
WOO	0.12.0

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.001

# -H Connection: close -t 4 -c 100 -d 10 http://localhost:5000 
Running 10s test @ http://localhost:5000
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   127.48ms    8.68ms 166.26ms   93.85%
    Req/Sec   195.29     57.04   252.00     83.75%
  7793 requests in 10.02s, 0.98MB read
  Socket errors: connect 0, read 7791, write 0, timeout 0
Requests/sec:    777.44
Transfer/sec:    100.22KB

# -H Connection: close -t 4 -c 10 -d 10 http://localhost:5000 
Running 10s test @ http://localhost:5000
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.90ms    6.08ms 120.19ms   98.95%
    Req/Sec   190.77     15.34   212.00     93.69%
  7569 requests in 10.02s, 0.95MB read
  Socket errors: connect 0, read 7568, write 0, timeout 0
Requests/sec:    755.21
Transfer/sec:     97.35KB

# -H Connection: close -t 16 -c 400 -d 10 http://localhost:5000 
Running 10s test @ http://localhost:5000
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   166.37ms   19.23ms 999.97ms   98.01%
    Req/Sec   122.67     68.76   390.00     61.73%
  7934 requests in 10.09s, 1.00MB read
  Socket errors: connect 0, read 7934, write 0, timeout 0
Requests/sec:    786.43
Transfer/sec:    101.38KB