benchmark/benchmark-result-2025-12-26/sleep_1ms/no-keep-alive/wookie_default.log
wookie_default.log
WOOKIE	0.3.15

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.001

# -H Connection: close -t 4 -c 100 -d 10 http://localhost:8080/hello-world 
Running 10s test @ http://localhost:8080/hello-world
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.17ms    2.49ms  28.84ms   78.75%
    Req/Sec     2.01k   175.41     2.53k    75.75%
  80205 requests in 10.01s, 5.89MB read
  Socket errors: connect 0, read 80200, write 0, timeout 0
Requests/sec:   8008.58
Transfer/sec:    602.21KB

# -H Connection: close -t 4 -c 10 -d 10 http://localhost:8080/hello-world 
Running 10s test @ http://localhost:8080/hello-world
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec     0.00      0.00     0.00      -nan%
  0 requests in 10.07s, 0.00B read
Requests/sec:      0.00
Transfer/sec:       0.00B

# -H Connection: close -t 16 -c 400 -d 10 http://localhost:8080/hello-world 
Running 10s test @ http://localhost:8080/hello-world
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec     0.00      0.00     0.00      -nan%
  0 requests in 10.09s, 0.00B read
Requests/sec:      0.00
Transfer/sec:       0.00B